{
  "_name_or_path": "lakshyakh93/deberta_finetuned_pii",
  "architectures": [
    "DebertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-PREFIX",
    "1": "I-PREFIX",
    "2": "B-FIRSTNAME",
    "3": "I-FIRSTNAME",
    "4": "B-MIDDLENAME",
    "5": "B-LASTNAME",
    "6": "I-LASTNAME",
    "7": "O",
    "8": "B-JOBDESCRIPTOR",
    "9": "B-JOBTITLE",
    "10": "I-JOBTITLE",
    "11": "B-COMPANY_NAME",
    "12": "I-COMPANY_NAME",
    "13": "B-JOBAREA",
    "14": "B-EMAIL",
    "15": "I-EMAIL",
    "16": "B-TIME",
    "17": "I-TIME",
    "18": "B-DATE",
    "19": "I-DATE",
    "20": "B-URL",
    "21": "I-URL",
    "22": "B-BITCOINADDRESS",
    "23": "I-BITCOINADDRESS",
    "24": "B-ETHEREUMADDRESS",
    "25": "I-ETHEREUMADDRESS",
    "26": "B-ACCOUNTNAME",
    "27": "I-ACCOUNTNAME",
    "28": "B-IBAN",
    "29": "I-IBAN",
    "30": "B-ACCOUNTNUMBER",
    "31": "I-ACCOUNTNUMBER",
    "32": "B-BIC",
    "33": "I-BIC",
    "34": "B-IPV4",
    "35": "I-IPV4",
    "36": "B-STREETADDRESS",
    "37": "I-STREETADDRESS",
    "38": "B-CITY",
    "39": "I-CITY",
    "40": "B-ZIPCODE",
    "41": "I-ZIPCODE",
    "42": "B-USERNAME",
    "43": "I-USERNAME",
    "44": "B-IPV6",
    "45": "I-IPV6",
    "46": "B-CREDITCARDNUMBER",
    "47": "I-CREDITCARDNUMBER",
    "48": "B-VEHICLEVIN",
    "49": "I-VEHICLEVIN",
    "50": "B-SUFFIX",
    "51": "I-SUFFIX",
    "52": "B-AMOUNT",
    "53": "I-AMOUNT",
    "54": "B-CURRENCY",
    "55": "I-CURRENCY",
    "56": "B-PASSWORD",
    "57": "I-PASSWORD",
    "58": "B-JOBTYPE",
    "59": "B-STATE",
    "60": "B-BUILDINGNUMBER",
    "61": "I-BUILDINGNUMBER",
    "62": "B-VEHICLEVRM",
    "63": "I-VEHICLEVRM",
    "64": "B-PHONEIMEI",
    "65": "I-PHONEIMEI",
    "66": "I-JOBAREA",
    "67": "I-STATE",
    "68": "B-COUNTY",
    "69": "B-CURRENCYNAME",
    "70": "I-CURRENCYNAME",
    "71": "B-CURRENCYSYMBOL",
    "72": "B-MASKEDNUMBER",
    "73": "I-MASKEDNUMBER",
    "74": "B-PHONE_NUMBER",
    "75": "I-PHONE_NUMBER",
    "76": "B-SECONDARYADDRESS",
    "77": "I-SECONDARYADDRESS",
    "78": "B-SSN",
    "79": "I-SSN",
    "80": "B-CURRENCYCODE",
    "81": "B-LITECOINADDRESS",
    "82": "I-LITECOINADDRESS",
    "83": "B-MAC",
    "84": "I-MAC",
    "85": "B-CREDITCARDISSUER",
    "86": "I-CREDITCARDISSUER",
    "87": "B-CREDITCARDCVV",
    "88": "I-CREDITCARDCVV",
    "89": "B-USERAGENT",
    "90": "I-USERAGENT",
    "91": "B-IP",
    "92": "I-IP",
    "93": "B-SEX",
    "94": "B-STREET",
    "95": "I-STREET",
    "96": "B-PIN",
    "97": "I-PIN",
    "98": "I-JOBTYPE",
    "99": "I-MIDDLENAME",
    "100": "I-CURRENCYCODE",
    "101": "I-CURRENCYSYMBOL",
    "102": "B-FULLNAME",
    "103": "I-FULLNAME",
    "104": "B-NAME",
    "105": "I-NAME",
    "106": "B-GENDER",
    "107": "B-NUMBER",
    "108": "I-NUMBER",
    "109": "I-GENDER",
    "110": "B-NEARBYGPSCOORDINATE",
    "111": "I-NEARBYGPSCOORDINATE",
    "112": "B-DISPLAYNAME",
    "113": "I-DISPLAYNAME",
    "114": "B-SEXTYPE",
    "115": "B-ORDINALDIRECTION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNTNAME": 26,
    "B-ACCOUNTNUMBER": 30,
    "B-AMOUNT": 52,
    "B-BIC": 32,
    "B-BITCOINADDRESS": 22,
    "B-BUILDINGNUMBER": 60,
    "B-CITY": 38,
    "B-COMPANY_NAME": 11,
    "B-COUNTY": 68,
    "B-CREDITCARDCVV": 87,
    "B-CREDITCARDISSUER": 85,
    "B-CREDITCARDNUMBER": 46,
    "B-CURRENCY": 54,
    "B-CURRENCYCODE": 80,
    "B-CURRENCYNAME": 69,
    "B-CURRENCYSYMBOL": 71,
    "B-DATE": 18,
    "B-DISPLAYNAME": 112,
    "B-EMAIL": 14,
    "B-ETHEREUMADDRESS": 24,
    "B-FIRSTNAME": 2,
    "B-FULLNAME": 102,
    "B-GENDER": 106,
    "B-IBAN": 28,
    "B-IP": 91,
    "B-IPV4": 34,
    "B-IPV6": 44,
    "B-JOBAREA": 13,
    "B-JOBDESCRIPTOR": 8,
    "B-JOBTITLE": 9,
    "B-JOBTYPE": 58,
    "B-LASTNAME": 5,
    "B-LITECOINADDRESS": 81,
    "B-MAC": 83,
    "B-MASKEDNUMBER": 72,
    "B-MIDDLENAME": 4,
    "B-NAME": 104,
    "B-NEARBYGPSCOORDINATE": 110,
    "B-NUMBER": 107,
    "B-ORDINALDIRECTION": 115,
    "B-PASSWORD": 56,
    "B-PHONEIMEI": 64,
    "B-PHONE_NUMBER": 74,
    "B-PIN": 96,
    "B-PREFIX": 0,
    "B-SECONDARYADDRESS": 76,
    "B-SEX": 93,
    "B-SEXTYPE": 114,
    "B-SSN": 78,
    "B-STATE": 59,
    "B-STREET": 94,
    "B-STREETADDRESS": 36,
    "B-SUFFIX": 50,
    "B-TIME": 16,
    "B-URL": 20,
    "B-USERAGENT": 89,
    "B-USERNAME": 42,
    "B-VEHICLEVIN": 48,
    "B-VEHICLEVRM": 62,
    "B-ZIPCODE": 40,
    "I-ACCOUNTNAME": 27,
    "I-ACCOUNTNUMBER": 31,
    "I-AMOUNT": 53,
    "I-BIC": 33,
    "I-BITCOINADDRESS": 23,
    "I-BUILDINGNUMBER": 61,
    "I-CITY": 39,
    "I-COMPANY_NAME": 12,
    "I-CREDITCARDCVV": 88,
    "I-CREDITCARDISSUER": 86,
    "I-CREDITCARDNUMBER": 47,
    "I-CURRENCY": 55,
    "I-CURRENCYCODE": 100,
    "I-CURRENCYNAME": 70,
    "I-CURRENCYSYMBOL": 101,
    "I-DATE": 19,
    "I-DISPLAYNAME": 113,
    "I-EMAIL": 15,
    "I-ETHEREUMADDRESS": 25,
    "I-FIRSTNAME": 3,
    "I-FULLNAME": 103,
    "I-GENDER": 109,
    "I-IBAN": 29,
    "I-IP": 92,
    "I-IPV4": 35,
    "I-IPV6": 45,
    "I-JOBAREA": 66,
    "I-JOBTITLE": 10,
    "I-JOBTYPE": 98,
    "I-LASTNAME": 6,
    "I-LITECOINADDRESS": 82,
    "I-MAC": 84,
    "I-MASKEDNUMBER": 73,
    "I-MIDDLENAME": 99,
    "I-NAME": 105,
    "I-NEARBYGPSCOORDINATE": 111,
    "I-NUMBER": 108,
    "I-PASSWORD": 57,
    "I-PHONEIMEI": 65,
    "I-PHONE_NUMBER": 75,
    "I-PIN": 97,
    "I-PREFIX": 1,
    "I-SECONDARYADDRESS": 77,
    "I-SSN": 79,
    "I-STATE": 67,
    "I-STREET": 95,
    "I-STREETADDRESS": 37,
    "I-SUFFIX": 51,
    "I-TIME": 17,
    "I-URL": 21,
    "I-USERAGENT": 90,
    "I-USERNAME": 43,
    "I-VEHICLEVIN": 49,
    "I-VEHICLEVRM": 63,
    "I-ZIPCODE": 41,
    "O": 7
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "c2p",
    "p2c"
  ],
  "position_biased_input": false,
  "relative_attention": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 0,
  "vocab_size": 50265
}
